In [1]:
import pathlib


PATH_DATA = pathlib.Path.cwd().parent.parent.parent / 'data'

# DataFrames

DataFrames are a fundamental object type for representing data sets. A DataFrame can be viewed in two ways:

* a sequence of named columns that each describe a single aspect of all entries in a data set, or
* a sequence of rows that each contain all information about a single entry in a data set.

In order to use DataFrames, import the module called `pandas`, from a Python library commonly used in data science.

Though you may simply `import pandas`, it is common to rename the module for quick reference within our code.

In [2]:
import pandas as pd

The pandas `DataFrame` may be constructed in a number of ways, depending on its data source.

Underlying each column of a `DataFrame` is a pandas `Series`.

A straight-forward manner of constructing a `DataFrame` is to specify its data as a Python `dict`, whose keys are column labels and whose values are `list`s or NumPy `array`s.

In [3]:
pd.DataFrame(
    {
        'Number of petals': [8, 34, 5],
    },
)

   Number of petals
0                 8
1                34
2                 5

To specify two (or more) columns, provide the label and values for each column. All columns must have the same length, or an error will occur.

In [4]:
pd.DataFrame(
    {
        'Name': ['lotus', 'sunflower', 'rose'],
        'Number of petals': [8, 34, 5],
    },
)

        Name  Number of petals
0      lotus                 8
1  sunflower                34
2       rose                 5

We can give this DataFrame a name, and then extend it with another column, using DataFrame method, `assign`.

In [5]:
flowers = pd.DataFrame(
    {
        'Name': ['lotus', 'sunflower', 'rose'],
        'Number of petals': [8, 34, 5],
    },
)

flowers.assign(
    Color=['pink', 'yellow', 'red'],
)

        Name  Number of petals   Color
0      lotus                 8    pink
1  sunflower                34  yellow
2       rose                 5     red

The `assign` method creates a new DataFrame each time it is called, so the original DataFrame is not affected. For example, the DataFrame `flowers` still has only the two columns that it had when it was created.

In [6]:
flowers

        Name  Number of petals
0      lotus                 8
1  sunflower                34
2       rose                 5

Creating DataFrames in this way involves a lot of typing. If the data have already been entered somewhere, it is usually possible to use Python to read it into a DataFrame, instead of typing it all in cell by cell.

Often, DataFrames are created from files that contain comma-separated values. Such files are called CSV files.

Below, we use the pandas function `read_csv` to read a CSV file that contains some of the data used by Minard in his graphic about Napoleon's Russian campaign. The data are placed in a DataFrame named `minard`.

In [7]:
minard = pd.read_csv(PATH_DATA / 'minard.csv')

minard

   Longitude  Latitude         City Direction  Survivors
0       32.0      54.8     Smolensk   Advance     145000
1       33.2      54.9  Dorogobouge   Advance     140000
2       34.4      55.5        Chjat   Advance     127100
3       37.6      55.8       Moscou   Advance     100000
4       34.3      55.2        Wixma   Retreat      55000
5       32.0      54.6     Smolensk   Retreat      24000
6       30.4      54.4       Orscha   Retreat      20000
7       26.8      54.3    Moiodexno   Retreat      12000

We will use this small data set to demonstrate some useful DataFrame methods. We will then use those same methods, and develop other methods, on much larger tables of data.

### The Shape of the Data ###

The `shape` of a DataFrame is its number of rows and columns.

In [8]:
minard.shape

(8, 5)

The number of rows can therefore be retrieved from the sequence returned by the `shape` property.

In [9]:
minard.shape[0]

8

…or the number of columns:

In [10]:
minard.shape[1]

5

### Column Labels 
The property `columns` can be used to list the labels of all the columns. With `minard` we don't gain much by this, but it can be very useful for tables that are so large that not all columns are visible on the screen.

In [11]:
minard.columns.to_list()

['Longitude', 'Latitude', 'City', 'Direction', 'Survivors']

We can change column labels using the `rename` method. This creates a new DataFrame and leaves `minard` unchanged.

In [12]:
minard.rename(
    columns={
        'City': 'City Name',
    },
)

   Longitude  Latitude    City Name Direction  Survivors
0       32.0      54.8     Smolensk   Advance     145000
1       33.2      54.9  Dorogobouge   Advance     140000
2       34.4      55.5        Chjat   Advance     127100
3       37.6      55.8       Moscou   Advance     100000
4       34.3      55.2        Wixma   Retreat      55000
5       32.0      54.6     Smolensk   Retreat      24000
6       30.4      54.4       Orscha   Retreat      20000
7       26.8      54.3    Moiodexno   Retreat      12000

However, this method does not change the original table.

In [13]:
minard

   Longitude  Latitude         City Direction  Survivors
0       32.0      54.8     Smolensk   Advance     145000
1       33.2      54.9  Dorogobouge   Advance     140000
2       34.4      55.5        Chjat   Advance     127100
3       37.6      55.8       Moscou   Advance     100000
4       34.3      55.2        Wixma   Retreat      55000
5       32.0      54.6     Smolensk   Retreat      24000
6       30.4      54.4       Orscha   Retreat      20000
7       26.8      54.3    Moiodexno   Retreat      12000

A common pattern is to assign the original name `minard` to the new DataFrame, so that all future uses of `minard` will refer to the relabeled data.

In [14]:
minard = minard.rename(
    columns={
        'City': 'City Name',
    },
)

minard

   Longitude  Latitude    City Name Direction  Survivors
0       32.0      54.8     Smolensk   Advance     145000
1       33.2      54.9  Dorogobouge   Advance     140000
2       34.4      55.5        Chjat   Advance     127100
3       37.6      55.8       Moscou   Advance     100000
4       34.3      55.2        Wixma   Retreat      55000
5       32.0      54.6     Smolensk   Retreat      24000
6       30.4      54.4       Orscha   Retreat      20000
7       26.8      54.3    Moiodexno   Retreat      12000

### Accessing the Data in a Column ###
We can use a column's label to access the series of data in the column.

In [15]:
minard['Survivors']

0    145000
1    140000
2    127100
3    100000
4     55000
5     24000
6     20000
7     12000
Name: Survivors, dtype: int64

For simple column labels, such as Survivors, we can even treat the column like a standard property of the DataFrame.

In [16]:
minard.Survivors

0    145000
1    140000
2    127100
3    100000
4     55000
5     24000
6     20000
7     12000
Name: Survivors, dtype: int64

(Note, however, that this latter syntax won't work for column labels containing spaces or punctuation beyond underscores – the label "this is cool!" cannot be accessed in this manner. Rather, it would have to be referred to as `minard['this is cool!']`.)

The 8 items in the series are indexed starting with 0, by default – 0, 1, 2, and so on, up to 7. The items in the column can be accessed as well.

In [17]:
minard['Survivors'][0]

145000

In [18]:
minard['Survivors'][5]

24000

### Working with the Data in a Column ###

Because columns are underpinned by arrays, we can use array operations on them to discover new information. For example, we can create a new column that contains the percent of all survivors at each city after Smolensk.

Because in this case we actually *want* to modify the original DataFrame – rather than preserve both – we'll use direct assignment, rather than the `assign` method.

(This has the added benefit that we can more easily specify a sophisticated label, which contains spaces. However, it is often a safe default course of action to create a new DataFrame, via `assign`.)

In [19]:
initial_count = minard['Survivors'][0]

minard['Percent Surviving'] = minard['Survivors'] / initial_count

minard

   Longitude  Latitude    City Name Direction  Survivors  Percent Surviving
0       32.0      54.8     Smolensk   Advance     145000           1.000000
1       33.2      54.9  Dorogobouge   Advance     140000           0.965517
2       34.4      55.5        Chjat   Advance     127100           0.876552
3       37.6      55.8       Moscou   Advance     100000           0.689655
4       34.3      55.2        Wixma   Retreat      55000           0.379310
5       32.0      54.6     Smolensk   Retreat      24000           0.165517
6       30.4      54.4       Orscha   Retreat      20000           0.137931
7       26.8      54.3    Moiodexno   Retreat      12000           0.082759

To make the proportions in the new column appear as percentages, we can use the `format` method of the DataFrame's `style` property. The `format` method accepts a single formatting function or formatting string, or a dictionary of formatters to apply by column.

Pandas uses the formatting string `"{:.2%}"` against data values as follows.

In [20]:
"{:.2%}".format(0.082759)

'8.28%'

And so we can apply this formatting string to our new column.

In [21]:
minard.style.format(
    {
        'Percent Surviving': "{:.2%}",
    },
)

And we can hang onto our formatting specification for reuse.

In [22]:
minard_format = {
    'Percent Surviving': "{:.2%}",
}

minard.style.format(minard_format)

### Choosing Sets of Columns ###

The property `loc` may be used to create a new DataFrame that contains only the specified columns.

In [23]:
minard.loc[:, ['Longitude', 'Latitude']]

   Longitude  Latitude
0       32.0      54.8
1       33.2      54.9
2       34.4      55.5
3       37.6      55.8
4       34.3      55.2
5       32.0      54.6
6       30.4      54.4
7       26.8      54.3

The same selection can be made directly against the DataFrame.

In [24]:
minard[['Longitude', 'Latitude']]

   Longitude  Latitude
0       32.0      54.8
1       33.2      54.9
2       34.4      55.5
3       37.6      55.8
4       34.3      55.2
5       32.0      54.6
6       30.4      54.4
7       26.8      54.3

The result of this syntax is a new DataFrame, even when you name just one column.

In [25]:
minard[['Survivors']]

   Survivors
0     145000
1     140000
2     127100
3     100000
4      55000
5      24000
6      20000
7      12000

Notice that the result is a DataFrame, unlike when we used only a single pair of brackets, which returns the underlying Series.

In [26]:
minard['Survivors']

0    145000
1    140000
2    127100
3    100000
4     55000
5     24000
6     20000
7     12000
Name: Survivors, dtype: int64

Another way to create a new DataFrame consisting of a set of columns is to `drop` the columns you don't want.

In [27]:
minard.drop(columns=['Longitude', 'Latitude', 'Direction'])

     City Name  Survivors  Percent Surviving
0     Smolensk     145000           1.000000
1  Dorogobouge     140000           0.965517
2        Chjat     127100           0.876552
3       Moscou     100000           0.689655
4        Wixma      55000           0.379310
5     Smolensk      24000           0.165517
6       Orscha      20000           0.137931
7    Moiodexno      12000           0.082759

Neither column selection nor the `drop` method change the original DataFrame. Instead, they create new smaller DataFrames that share the same data. The fact that the original DataFrame is preserved is useful! You can generate multiple different DataFrames that only consider certain columns without worrying that one analysis will affect the other.

In [28]:
minard.style.format(minard_format)

All of the methods that we have used above can be applied to any DataFrame.